1. 첫번째
Flexbox는 <strong>1차원 레이아웃 속성</strong>으로, row 또는 column 중 하나를 기준으로 요소를 정렬하고 배치한다.
주로 행이나 열 중 하나의 방향으로 정렬해야 할 때 유용하며, 복잡한 행과 열을 모두 포함하는 레이아웃에는 한계가 있다.

Grid는 <strong>2차원 레이아웃 속성</strong>으로, 행과 열을 모두 사용해 요소를 배치한다. 복잡한 레이아웃 구성, 
웹페이지의 전체적인 구조를 잡는 데 적합하다.

2. 두번째(사용 목적)
Flexbox는 <strong>콘텐츠 중심으로, 콘텐츠가 추가되거나 줄어들 때 유연하게 대처</strong>한다.
ex) 수평 또는 수직 방향으로 콘텐츠를 정렬하고 간격을 조절, 버튼 그룹, 네비게이션 바 등 한 줄의 콘텐츠가 주가 되는 구성에 적합

Grid는 <strong>레이아웃 중심으로 페이지 구조를 구성하는 데 최적화</strong>되어 있다.
ex) 레이아웃, 갤러리 형식 등 명확하게 구분된 영역을 기반으로 레이아웃 구성 시 적합

3. 세번째(기본 동작)
Flexbox는 요소가 <strong>컨테이너의 크기나 위치에 맞춰 자동으로 정렬</strong>된다. Flexbox는 jutify-content와 align-items 속성을 사용해, 주 축 방향으로 요소들을 배치하고 여백을 조절할 수 있다.

Grid는 <strong>행과 열을 사전에 정의하고 그 격자(grid cell)에 요소를 배치하는 방식</strong>이다.
Grid에서는 grid-template-rows, grid-template-columns와 같은 속성으로 행과 열의 크기를 정의하고, 각 요소의 위치를 설정할 수 있다.
